def калькулятор():
    print("Калькуляторго кош келиңиз!")
    print("1. Кошуу (+)")
    print("2. Алуу (-)")
    print("3. Көбөйтүү (*)")
    print("4. Бөлүү (/)")
    
    операция = input("Эмне операция жасашты каалайсыз? (1/2/3/4): ")

    if операция in ['1', '2', '3', '4']:
        сан1 = float(input("Алгачкы санды киргизиңиз: "))
        сан2 = float(input("Экинчи санды киргизиңиз: "))
        
        if операция == '1':
            натыйжа = сан1 + сан2
            операция_аталышы = "+"
        elif операция == '2':
            натыйжа = сан1 - сан2
            операция_аталышы = "-"
        elif операция == '3':
            натыйжа = сан1 * сан2
            операция_аталышы = "*"
        elif операция == '4':
            if сан2 == 0:
                return "Бөлүүдө 0га бөлүүгө болбойт!"
            натыйжа = сан1 / сан2
            операция_аталышы_
